<?xml version="1.0" ?>
<net batch="1" name="person-detection-action-recognition-0006" version="6">
	<layers>
		<layer id="0" name="input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="ActionNet/twinnet/shared/init_norm/batchnorm/mul_1/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="ActionNet/twinnet/shared/init_block/dim_inc_conv/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="3456"/>
				<biases offset="3480" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="ActionNet/twinnet/shared/init_block/dim_inc_conv/ActionNet/twinnet/shared/init_block/dim_inc_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ActionNet/twinnet/shared/bottleneck1_1/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3608" size="1024"/>
				<biases offset="4632" size="32"/>
			</blobs>
		</layer>
		<layer id="5" name="ActionNet/twinnet/shared/bottleneck1_1/dim_red/ActionNet/twinnet/shared/bottleneck1_1/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ActionNet/twinnet/shared/bottleneck1_1/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4664" size="288"/>
				<biases offset="4952" size="32"/>
			</blobs>
		</layer>
		<layer id="7" name="ActionNet/twinnet/shared/bottleneck1_1/inner_conv/ActionNet/twinnet/shared/bottleneck1_1/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ActionNet/twinnet/shared/bottleneck1_1/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4984" size="1024"/>
				<biases offset="6008" size="128"/>
			</blobs>
		</layer>
		<layer id="9" name="ActionNet/twinnet/shared/bottleneck1_1/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="ActionNet/twinnet/shared/bottleneck1_1/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="ActionNet/twinnet/shared/bottleneck1_2/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6136" size="1024"/>
				<biases offset="7160" size="32"/>
			</blobs>
		</layer>
		<layer id="12" name="ActionNet/twinnet/shared/bottleneck1_2/dim_red/ActionNet/twinnet/shared/bottleneck1_2/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="ActionNet/twinnet/shared/bottleneck1_2/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7192" size="288"/>
				<biases offset="7480" size="32"/>
			</blobs>
		</layer>
		<layer id="14" name="ActionNet/twinnet/shared/bottleneck1_2/inner_conv/ActionNet/twinnet/shared/bottleneck1_2/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ActionNet/twinnet/shared/bottleneck1_2/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7512" size="1024"/>
				<biases offset="8536" size="128"/>
			</blobs>
		</layer>
		<layer id="16" name="ActionNet/twinnet/shared/bottleneck1_2/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="ActionNet/twinnet/shared/bottleneck1_2/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ActionNet/twinnet/shared/bottleneck1_3/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8664" size="1024"/>
				<biases offset="9688" size="32"/>
			</blobs>
		</layer>
		<layer id="19" name="ActionNet/twinnet/shared/bottleneck1_3/dim_red/ActionNet/twinnet/shared/bottleneck1_3/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ActionNet/twinnet/shared/bottleneck1_3/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9720" size="288"/>
				<biases offset="10008" size="32"/>
			</blobs>
		</layer>
		<layer id="21" name="ActionNet/twinnet/shared/bottleneck1_3/inner_conv/ActionNet/twinnet/shared/bottleneck1_3/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ActionNet/twinnet/shared/bottleneck1_3/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10040" size="1024"/>
				<biases offset="11064" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="ActionNet/twinnet/shared/bottleneck1_3/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="ActionNet/twinnet/shared/bottleneck1_3/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ActionNet/twinnet/shared/bottleneck1_4/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11192" size="1024"/>
				<biases offset="12216" size="32"/>
			</blobs>
		</layer>
		<layer id="26" name="ActionNet/twinnet/shared/bottleneck1_4/dim_red/ActionNet/twinnet/shared/bottleneck1_4/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="ActionNet/twinnet/shared/bottleneck1_4/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12248" size="288"/>
				<biases offset="12536" size="32"/>
			</blobs>
		</layer>
		<layer id="28" name="ActionNet/twinnet/shared/bottleneck1_4/inner_conv/ActionNet/twinnet/shared/bottleneck1_4/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ActionNet/twinnet/shared/bottleneck1_4/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12568" size="1024"/>
				<biases offset="13592" size="128"/>
			</blobs>
		</layer>
		<layer id="30" name="ActionNet/twinnet/shared/bottleneck1_4/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="ActionNet/twinnet/shared/bottleneck1_4/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="ActionNet/twinnet/shared/bottleneck2_0/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13720" size="2048"/>
				<biases offset="15768" size="64"/>
			</blobs>
		</layer>
		<layer id="33" name="ActionNet/twinnet/shared/bottleneck2_0/dim_red/ActionNet/twinnet/shared/bottleneck2_0/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="ActionNet/twinnet/shared/bottleneck2_0/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15832" size="576"/>
				<biases offset="16408" size="64"/>
			</blobs>
		</layer>
		<layer id="35" name="ActionNet/twinnet/shared/bottleneck2_0/inner_conv/ActionNet/twinnet/shared/bottleneck2_0/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="ActionNet/twinnet/shared/bottleneck2_0/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16472" size="4096"/>
				<biases offset="20568" size="256"/>
			</blobs>
		</layer>
		<layer id="37" name="ActionNet/twinnet/shared/bottleneck2_0/max_pool/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="ActionNet/twinnet/shared/bottleneck2_0/skip_conv/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="20824" size="8192"/>
				<biases offset="29016" size="256"/>
			</blobs>
		</layer>
		<layer id="39" name="ActionNet/twinnet/shared/bottleneck2_0/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ActionNet/twinnet/shared/bottleneck2_0/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="ActionNet/twinnet/shared/bottleneck2_1/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="29272" size="4096"/>
				<biases offset="33368" size="64"/>
			</blobs>
		</layer>
		<layer id="42" name="ActionNet/twinnet/shared/bottleneck2_1/dim_red/ActionNet/twinnet/shared/bottleneck2_1/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="ActionNet/twinnet/shared/bottleneck2_1/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="33432" size="576"/>
				<biases offset="34008" size="64"/>
			</blobs>
		</layer>
		<layer id="44" name="ActionNet/twinnet/shared/bottleneck2_1/inner_conv/ActionNet/twinnet/shared/bottleneck2_1/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="ActionNet/twinnet/shared/bottleneck2_1/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34072" size="4096"/>
				<biases offset="38168" size="256"/>
			</blobs>
		</layer>
		<layer id="46" name="ActionNet/twinnet/shared/bottleneck2_1/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="ActionNet/twinnet/shared/bottleneck2_1/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="ActionNet/twinnet/shared/bottleneck2_2/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="38424" size="4096"/>
				<biases offset="42520" size="64"/>
			</blobs>
		</layer>
		<layer id="49" name="ActionNet/twinnet/shared/bottleneck2_2/dim_red/ActionNet/twinnet/shared/bottleneck2_2/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="ActionNet/twinnet/shared/bottleneck2_2/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="42584" size="576"/>
				<biases offset="43160" size="64"/>
			</blobs>
		</layer>
		<layer id="51" name="ActionNet/twinnet/shared/bottleneck2_2/inner_conv/ActionNet/twinnet/shared/bottleneck2_2/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ActionNet/twinnet/shared/bottleneck2_2/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="43224" size="4096"/>
				<biases offset="47320" size="256"/>
			</blobs>
		</layer>
		<layer id="53" name="ActionNet/twinnet/shared/bottleneck2_2/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="ActionNet/twinnet/shared/bottleneck2_2/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="ActionNet/twinnet/shared/bottleneck2_3/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="47576" size="4096"/>
				<biases offset="51672" size="64"/>
			</blobs>
		</layer>
		<layer id="56" name="ActionNet/twinnet/shared/bottleneck2_3/dim_red/ActionNet/twinnet/shared/bottleneck2_3/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="ActionNet/twinnet/shared/bottleneck2_3/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="51736" size="576"/>
				<biases offset="52312" size="64"/>
			</blobs>
		</layer>
		<layer id="58" name="ActionNet/twinnet/shared/bottleneck2_3/inner_conv/ActionNet/twinnet/shared/bottleneck2_3/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="ActionNet/twinnet/shared/bottleneck2_3/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="52376" size="4096"/>
				<biases offset="56472" size="256"/>
			</blobs>
		</layer>
		<layer id="60" name="ActionNet/twinnet/shared/bottleneck2_3/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="ActionNet/twinnet/shared/bottleneck2_3/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="ActionNet/twinnet/shared/bottleneck2_4/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="56728" size="4096"/>
				<biases offset="60824" size="64"/>
			</blobs>
		</layer>
		<layer id="63" name="ActionNet/twinnet/shared/bottleneck2_4/dim_red/ActionNet/twinnet/shared/bottleneck2_4/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="ActionNet/twinnet/shared/bottleneck2_4/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="60888" size="576"/>
				<biases offset="61464" size="64"/>
			</blobs>
		</layer>
		<layer id="65" name="ActionNet/twinnet/shared/bottleneck2_4/inner_conv/ActionNet/twinnet/shared/bottleneck2_4/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="ActionNet/twinnet/shared/bottleneck2_4/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="61528" size="4096"/>
				<biases offset="65624" size="256"/>
			</blobs>
		</layer>
		<layer id="67" name="ActionNet/twinnet/shared/bottleneck2_4/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ActionNet/twinnet/shared/bottleneck2_4/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="ActionNet/twinnet/shared/bottleneck2_5/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="65880" size="4096"/>
				<biases offset="69976" size="64"/>
			</blobs>
		</layer>
		<layer id="70" name="ActionNet/twinnet/shared/bottleneck2_5/dim_red/ActionNet/twinnet/shared/bottleneck2_5/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="ActionNet/twinnet/shared/bottleneck2_5/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="70040" size="576"/>
				<biases offset="70616" size="64"/>
			</blobs>
		</layer>
		<layer id="72" name="ActionNet/twinnet/shared/bottleneck2_5/inner_conv/ActionNet/twinnet/shared/bottleneck2_5/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="ActionNet/twinnet/shared/bottleneck2_5/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="70680" size="4096"/>
				<biases offset="74776" size="256"/>
			</blobs>
		</layer>
		<layer id="74" name="ActionNet/twinnet/shared/bottleneck2_5/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="ActionNet/twinnet/shared/bottleneck2_5/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="ActionNet/twinnet/shared/bottleneck2_6/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="75032" size="4096"/>
				<biases offset="79128" size="64"/>
			</blobs>
		</layer>
		<layer id="77" name="ActionNet/twinnet/shared/bottleneck2_6/dim_red/ActionNet/twinnet/shared/bottleneck2_6/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ActionNet/twinnet/shared/bottleneck2_6/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="79192" size="576"/>
				<biases offset="79768" size="64"/>
			</blobs>
		</layer>
		<layer id="79" name="ActionNet/twinnet/shared/bottleneck2_6/inner_conv/ActionNet/twinnet/shared/bottleneck2_6/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="ActionNet/twinnet/shared/bottleneck2_6/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="79832" size="4096"/>
				<biases offset="83928" size="256"/>
			</blobs>
		</layer>
		<layer id="81" name="ActionNet/twinnet/shared/bottleneck2_6/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ActionNet/twinnet/shared/bottleneck2_6/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="ActionNet/twinnet/shared/bottleneck2_7/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="84184" size="4096"/>
				<biases offset="88280" size="64"/>
			</blobs>
		</layer>
		<layer id="84" name="ActionNet/twinnet/shared/bottleneck2_7/dim_red/ActionNet/twinnet/shared/bottleneck2_7/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="ActionNet/twinnet/shared/bottleneck2_7/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="88344" size="576"/>
				<biases offset="88920" size="64"/>
			</blobs>
		</layer>
		<layer id="86" name="ActionNet/twinnet/shared/bottleneck2_7/inner_conv/ActionNet/twinnet/shared/bottleneck2_7/inner_conv_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ActionNet/twinnet/shared/bottleneck2_7/dim_inc/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="88984" size="4096"/>
				<biases offset="93080" size="256"/>
			</blobs>
		</layer>
		<layer id="88" name="ActionNet/twinnet/shared/bottleneck2_7/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="ActionNet/twinnet/shared/bottleneck2_7/LeakyRelu" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="ActionNet/twinnet/shared/bottleneck2_8/dim_red/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="93336" size="4096"/>
				<biases offset="97432" size="64"/>
			</blobs>
		</layer>
		<layer id="91" name="ActionNet/twinnet/shared/bottleneck2_8/dim_red/ActionNet/twinnet/shared/bottleneck2_8/dim_red_fn_activation" precision="FP32" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="ActionNet/twinnet/shared/bottleneck2_8/inner_conv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
			<blobs>
				<weights offset="97496" size="576"/>
